saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/NXP.MK22F25612_DFP.11.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.0.1" condition="device.MK22F25612_AND_device.MK22F25612_CMSIS_AND_driver.clock">
      <description>COMMON Driver; {for-development:SDK-Manifest-ID: platform.drivers.common.MK22F25612}</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MK22F25612" Cversion="1.0.0" condition="device.MK22F25612_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MK22F25612_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.port_AND_driver.smc_AND_driver.uart_AND_utility.debug_console" isDefaultVariant="1">
      <description>{for-development:SDK-Manifest-ID: project_template.MK22F25612.MK22F25612}</description>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MK22F25612_startup" Cversion="1.0.0" condition="device.MK22F25612_AND_CMSIS_Include_core_cm4">
      <description>{for-development:SDK-Manifest-ID: device.MK22F25612_startup.MK22F25612}</description>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MK22F25612.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MK22F25612.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK22FN128xxx12_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK22FN128xxx12_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK22FN256xxx12_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK22FN256xxx12_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK22FN128xxx12_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK22FN128xxx12_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK22FN256xxx12_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK22FN256xxx12_ram.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="MK22F25612.h"/>
        <file category="header" attr="config" name="MK22F25612_features.h"/>
        <file category="sourceC" attr="config" name="system_MK22F25612.c"/>
        <file category="header" attr="config" name="system_MK22F25612.h"/>
      </files>
    </component>
  </components>
</package>
